cfd/OpenFOAM/incompressible/simpleFoam/03_Validation_2D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $pressure;


boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        fixedValue;
        value       $internalField;
    }

    freestream
    {
        type        zeroGradient;
    }
    
    model
    {
        type        zeroGradient;
    }

    symLeft
    {
        type        symmetryPlane;
    }

    symRight
    {
        type        symmetryPlane;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
