cfd/OpenFOAM/incompressible/simpleFoam/03_Validation_2D/system/include/controlVolume
// control volume dimensions
controlVolOriginX -4;
controlVolLength   16;
controlVolHeight   8;

// cell size
controlVolCellSize 0.25;