cfd/OpenFOAM/incompressible/simpleFoam/03_Validation_2D/system/include/referenceData
// reference data for force coefficient computations
referenceLength     1.0;
referenceArea       1.0;
